Autodesk.Revit.DB.Architecture.CutMarkType.CutLineType
The cut line type of the cut mark.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Architecture.CutMarkType.CutMarkSymbol
The symbol type of the cut mark.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Architecture.CutMarkType.CutLineDistance
The distance between 2 cut lines.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for distanceBetweenTwoLines must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The cut mark type is not a double cut line type.
Since:
2013

Autodesk.Revit.DB.Architecture.CutMarkType.CutLineExtension
The extension distance to the boundary.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for extensionDistanceToBoundary must be between 0 and 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.CutMarkType.CutLineAngle
The rotation angle of the cut mark.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for rotationAngle is not finite
Since:
2013

Autodesk.Revit.DB.Architecture.CutMarkType.CutMarkSymbolSize
The size of the cut mark symbol.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for cutMarkSymbolSize must be greater than 0 and no more than 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.CutMarkType
An object represents the cut mark type in Autodesk Revit.
Since:
2013